Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В колонке "%s" значение "%s" не удалось преобразовать к дате/времени.
en: Failed to convert "%1:s" value in "%0:s" column to date/time.

source: В колонке "%s" значение "%s" не удалось преобразовать к вещественному числу.
en: Failed to convert "%1:s" value in "%0:s" column to real number.

source: В колонке "%s" значение "%s" не удалось преобразовать к целому числу.
en: Failed to convert "%1:s" value in "%0:s" column to integer.

source: При разборе текстового файла достигнут предел чтения (максимальное количество байт: %d)
en: When parsing the text file, the reading limit was reached (the maximum byte count is %d)

source: При разборе текстового файла мультистрока превысила максимальную длину %d символа раньше, чем был найден закрывающий ограничитель строк. Номер строки файла с началом мультистроки: %d. Последняя строка файла, вошедшая в мультистроку: %d.
en: When parsing the text file, the multiline exceeded maximum length of %d characters before the closing text qualifier was found. The number of the file line where multiline starts: %d. The last file line included into the multiline: %d.

source: Конец текстового файла достигнут раньше, чем найден закрывающий ограничитель строк. Номер строки файла с началом мультистроки: %d.
en: The text file end was reached before closing text qualifier was found. The file line number with multiline start: %d.

source: Расширение конечной точки (порта) "%s" не указано или не поддерживается
en: "%s" endpoint (port) extension not specified or not supported

source: Кодовая страница %d не поддерживается
en: Codepage %d not supported

source: <Ключ>
en: <Key>

source: Импорт данных из текстового файла
en: Import data from text file

source: Дерево импорта не настроено
en: Import tree not configured

source: Не выбрано ни одного узла для импорта
en: No nodes selected for import

source: Тип порта "%s" для связывания "%s" не найден
en: "%s" port type for "%s" binding not found

source: Ошибка при выполнении импорта XML. Код ошибки: %d. Сообщение: %s
en: Error importing XML. Error code: %d. Message: %s

source: Валидация по Schematron правилам не пройдена
en: Failed to validate against Schematron rules

source: Не пройдена проверка "%s" для узла %s в строке %d
en: Failed to validate "%s" for the node %s, line %d

source: Импорт данных из файла XML в соответствии с заданной схемой XSD
en: Import data from XML file according to the specified XSD schema

source: Не удалось получить путь к БД
en: Failed to get path to DB

source: Часть "%s" ссылается на элемент "%s"{"%s"}, который не найден в XSD-схеме
en: "%s" part references "%s"{"%s"} element not found in XSD schema

source: Не указана строка подключения
en: Empty connection string

source: Подключения к локальным БД сервера запрещены
en: Connections to local databases on server are forbidden

source: Ошибка подключения к 1C
en: 1C connection error

source: Ошибка в строке подключения
en: Error in connection string

source: Ошибка проверки подключения 1C
en: 1C connection test error

source: 1С:Предприятие 8
en: 1C:Enterprise 8

source: База данных - 1С:Предприятие 8
en: Database - 1C:Enterprise 8

source: Номер столбца %d вне диапазона [%d, %d]
en: Column number %d is out of [%d, %d] range

source: Ошибка при чтении набора данных
en: Error occurred while reading the dataset

source: Часть "%s" ссылается на тип "%s"{"%s"}, который не найден в XSD-схеме
en: "%s" part references "%s"{"%s"} type not found in XSD schema

source: Не удалось получить список доступных кластеров
en: Failed to receive the list of available clusters

source: Не удалось получить описания полей для таблицы "%s"
en: Failed to get descriptions of fields for "%s" table

source: Параметр конфигурации с именем "%s" не существует
en: Configuration parameter with "%s" name does not exist

source: Столбец "%s" (тип %s) не может принимать значения Null
en: Column "%s" (type %s) cannot have Null values

source: Длина строки %d превышает допустимую для столбца "%s" (тип %s)
en: String length %d exceeds the length allowed for column "%s" (type %s)

source: Значение %g выходит за границы допустимого диапазона столбца "%s" (тип %s)
en: Value %g is out of allowed range for column "%s" (type %s)

source: Значение %d выходит за границы допустимого диапазона столбца "%s" (тип %s)
en: Value %d is out of allowed range for column "%s" (type %s)

source: Невозможно преобразовать значение вещественного типа %g к значению Decimal (столбец "%s")
en: Failed to convert the real value %g to the Decimal value ("%s" column)

source: В WSDL-описании не допускается более одного элемента <%s/>
en: More than one <%s/> element not allowed in WSDL description

source: Тип данных столбца "%s" не поддерживается
en: Column data type "%s" not supported

source: Указан некорректный номер порта: %s
en: Invalid port number specified: %s

source: INSERT не содержит значений
en: INSERT doesn't contain values

source: ClickHouse не поддерживает хранимые процедуры
en: ClickHouse does not support stored procedures

source: TRUNCATE запрещено: таблица с Engine = Distributed создана на кластере "%s" (выбран "%s")
en: TRUNCATE not allowed: the table with Engine = Distributed was created on cluster "%s" ("%s" is selected)

source: Получение списка кластеров
en: Receiving cluster list

source: Ошибка ClickHouse: %s
en: ClickHouse error: %s

source: Дата %s выходит за пределы допустимого диапазона [%s, %s)
en: Date %s is out of allowable range [%s, %s)

source: Дата %s выходит за пределы допустимого диапазона [%s, %s]
en: Date %s is out of allowable range [%s, %s]

source: Для SOAP операции с транспортом HTTP обязательно указание элемента расширения "<soap:operation/>" с атрибутом soapAction
en: It is required to specify "<soap:operation/>" extension element with soapAction attribute for SOAP HTTP transport operations

source: Удаление запрещено: таблица с Engine = Distributed создана на кластере "%s" (выбран "%s")
en: Deleting not allowed: the table with Engine = Distributed was created on cluster "%s" ("%s" is selected)

source: Тайм-аут подключения
en: Connection timeout

source: Подключение прервано
en: Connection aborted

source: Ошибка выполнения хранимой процедуры "%s"
en: Error executing stored procedure "%s"

source: Ошибка выполнения SQL: %s
en: Error while executing SQL: %s

source: Ошибка получения полей таблицы "%s"
en: Error receiving fields of table "%s"

source: Сообщение "%s", на которое ссылается операция "%s" связывания "%s", не является SOAP-сообщением, однако содержит тело SOAP
en: "%s" message referenced by "%s" operation of "%s" binding is not SOAP message, but it contains SOAP body

source: Неверный формат строки подключения
en: Invalid format of connection string

source: Имя базы данных указано неверно
en: Invalid database name

source: Порт указан неверно
en: Invalid port

source: Сервер указан неверно
en: Invalid server

source: Не указаны столбцы по которым необходимо сделать индекс
en: No columns to make an index are specified

source: Текущему пользователю запрещено отключать запрос пароля
en: Disabling login prompt is not allowed for the current user

source: Время ожидания ввода логина и пароля для подключения истекло
en: The timeout for entering the username and password for connection has expired

source: Сессия не принадлежит базе данных
en: Session does not belong to the database

source: Ошибка открытия SQL: %s
en: Error while opening SQL: %s

source: SOAP-сообщения в стиле "document" с типом использования "encoded" не поддерживаются
en: "Document" style SOAP messages with "encoded" usage type are not supported

source: Типы параметров не совпадают
en: Parameter types do not match

source: Ошибка подготовки хранимой процедуры "%s"
en: Error preparing stored procedure "%s"

source: Ошибка подготовки SQL: %s
en: SQL preparation error: %s

source: Не указано имя схемы
en: No schema name specified

source: Ошибка установки Sequence для DB. Старый Sequence = %d
en: Sequence initialization error for DB. Old Sequence = %d

source: Таблица не существует
en: The table doesn't exist

source: Ошибка проверки подключения
en: Connection test error

source: Ошибка очистки подготовленного запроса
en: Error clearing prepared query

source: Тайм-аут блокировки
en: Lock timeout

source: Неподдерживаемая комбинация параметров: часть "%s", определенная ссылкой на тип XSD-схемы, назначается сообщению SOAP в стиле document с типом использования literal
en: Unsupported combination of parameters: "%s" part referenced as XSD schema type is assigned to document style SOAP message with literal usage type

source: Не указан пароль для подключения к "%s"
en: No password entered for connection to "%s"

source: Запрос уже выполняется
en: The query is already executing

source: Ошибка при дешифрации закрытого ключа
en: Error decrypting private key

source: Указанный режим "%s" проверки сертификата сервера не поддерживается
en: The specified server certificate check mode "%s" is not supported

source: Избыточное число разделителей "." в имени объекта "%s"
en: Too many "." separators in the object name "%s"

source: Для SOAP-сообщения "%s", на которое ссылается операция "%s" связывания "%s", указано более одного типа расширения
en: For "%s" SOAP message referenced by "%s" operation of "%s" binding, more than one extension type is specified

source: Нет ссылки на функцию
en: No reference to function

source: Достигнут конец набора данных
en: Dataset end reached

source: ODBC-драйвер для подключения к базам данных MS Access не установлен
en: ODBC driver for connection to MS Access databases not installed

source: Не указан Email сервисного аккаунта
en: No service account e-mail specified

source: Имя набора данных указано неверно
en: Invalid dataset name

source: Название проекта указано неверно
en: Invalid project name

source: Не указан путь к файлу секретного ключа
en: Path to the private key file is not specified

source: Файл ключа "%s" не найден
en: "%s" key file not found

source: ODBC-драйвер "%s" для подключения к BigQuery не установлен. Установочные пакеты и краткое описание драйвера можно найти по адресу:
en: ODBC driver "%s" for connection to BigQuery not installed. Installation packages and brief driver description are available at the following address:

source: Не указан токен для аутентификации
en: No token specified for authentication

source: Файл сертификата "%s" не найден
en: "%s" certificate file not found

source: Версия SOAP операции %s конфликтует с версией связывания %s
en: SOAP version of %s operation conflicts with %s binding version

source: ODBC-драйвер для подключения к Excel файлам не установлен
en: ODBC driver for Excel files not installed

source: ODBC-драйвер не установлен (%s)
en: ODBC driver not installed (%s)

source: Драйвер "%s" не установлен
en: Driver "%s" not installed

source: Неизвестный ODBC-драйвер для подключения к SQL Server (%s=%s). Подходящий драйвер будет выбран автоматически.
en: Unknown ODBC driver for SQL Server connection (%s=%s). A matching driver will be selected automatically.

source: Неподдерживаемая комбинация параметров: часть "%s", определенная ссылкой на элемент XSD-схемы, назначается сообщению SOAP в стиле RPC
en: Unsupported combination of parameters: "%s" part referenced as XSD schema element is assigned to RPC style SOAP message

source: Не удалось загрузить библиотеку клиента MySQL (%s)
en: Failed to load MySQL client library (%s)

source: Ошибка при разборе шаблона имени драйвера: %s
en: Error parsing driver name template: %s

source: Драйвер "%s" не зарегистрирован в Loginom
en: "%s" driver not registered in Loginom

source: В строке подключения не указан драйвер ODBC
en: No ODBC driver specified in connection string

source: Источник данных не поддерживает идентификаторы в кавычках, драйвер "%s"
en: Data source does not support quoted identifiers, "%s" driver

source: Подключения через файловые DSN запрещены
en: Connections through file DSN are forbidden

source: Не удалось получить информацию о типах полей таблиц
en: Failed to receive information about table field types

source: SOAP транспорты, кроме HTTP, в настоящее время не поддерживаются
en: SOAP transports except for HTTP are currently not supported

source: %s имеет неподдерживаемые типы данных
en: %s has unsupported data types

source: таблица %s имеет заданное правило (RULE)
en: table %s has a rule specified

source: %s не является таблицей
en: %s is not a table

source: Установленные на таблицу %s правила (RULE) будут проигнорированы
en: Rules set for table %s will be ignored

source: Не указано имя файла
en: No file name specified

source: Имя файла указано неверно, запрещены символы: %s
en: File name is incorrectly specified, the following characters are prohibited: %s

source: Последняя команда в SQL-скрипте не возвращает курсор
en: The last command in SQL script does not return the cursor

source: Ошибка в определении input-сообщения операции "%s" связывания "%s": сообщение типа "%s" не разрешено для метода запроса "%s"
en: Error defining input message of "%s" operation of "%s" binding: message of "%s" type is not allowed for "%s" request method

source: Не удалось загрузить расширение SQLite "%s"
en: Failed to load SQLite extension "%s"

source: Ошибка SQLite:
en: SQLite error:

source: Переопределение функций для версий SQLite ниже 3.7.3 не поддерживается
en: Function override for SQLite versions below 3.7.3 not supported

source: Список серверов СУБД недоступен
en: List of DBMS servers unavailable

source: Не удалось получить путь до файла "%s"
en: Failed to get path to "%s" file

source: Не удалось создать папку "%s" в процессе распаковки архива
en: Failed to create "%s" folder while extracting the archive

source: Не удалось распаковать файл "%s", папка с таким именем уже существует
en: Failed to extract "%s" file, a folder with the same name already exists

source: Не удалось создать папку "%s", файл с таким именем уже существует
en: Failed to create "%s" folder, a file with the same name already exists

source: Ошибка XML при разборе схемы вложенной в WSDL-файл
en: XML error while parsing the schema included into WSDL file

source: Индекс бита вне диапазона
en: Bit index is out of range

source: Строка "%s" не является представлением множества
en: "%s" string is not a valid set representation

source: Попытка извлечения всех подмножеств с мощностью меньше 0 или больше мощности самого множества
en: Attempt to extract all subsets with the power less than 0 or more than the set power as such

source: Блоки объединённого набора не были заполнены
en: Blocks of combined set not filled

source: Запрошенный блок объединённого набора не существует
en: The requested block of the combined set doesn't exist

source: Выход за пределы выделенного блока в объединённом наборе данных
en: Out of the selected block's range in the combined dataset

source: Запрошенная часть объединённого набора не существует
en: The requested part of the combined set doesn't exist

source: Достигнут предел максимального кол-ва строк
en: Maximum row count limit reached

source: Куча целевого набора уже загружена
en: Target set heap already loaded

source: Объединённый набор данных не подготовлен к заполнению
en: Combined dataset not prepared to be filled

source: Нет доступа к импортируемому документу %s
en: No access to the imported %s document

source: Объединённый набор данных уже подготовлен к заполнению
en: Combined dataset already prepared to be filled

source: Невозможно получить внешний ключ для узла с идентификатором %d: узел не является массивом
en: Failed to get the foreign key for the node with identifier %d: the node is not an array

source: Невозможно получить флаг наличия узла с идентификатором %d: узел не является простым контейнером
en: Failed to get the node exist flag with identifier %d: the node is not a simple container

source: Невозможно получить значение узла с идентификатором %d: узел является контейнером
en: Failed to get the node value with identifier %d: the node is a container

source: Невозможно получить диапазон строк для узла с идентификатором %d: узел не является массивом
en: Failed to get the row range for the node with identifier %d: the node is not an array

source: Некорректное описание узла: %s
en: Invalid node description: %s

source: Недопустимый идентификатор узла: %d
en: Invalid node identifier: %d

source: Номер таблицы %d вне диапазона [%d, %d]
en: Table number %d is out of [%d, %d] range

source: Данный способ загрузки конфигурации не поддерживается
en: This method of configuration loading not supported

source: "%s" не является правильным идентификатором
en: "%s" is not a valid identifier

source: %s с именем "%s" уже существует
en: %s with "%s" name already exists

source: %s с идентификатором %s не найден
en: %s with %s identifier not found

source: %s с идентификатором %d не найден
en: %s with identifier %d not found

source: %s с именем "%s" не найден
en: %s with "%s" name not found

source: %s с идентификатором %s уже существует
en: %s with identifier %s already exists

source: %s с идентификатором %d уже существует
en: %s with %d identifier already exists

source: Ошибка загрузки элемента коллекции
en: Error loading collection item

source: Элементы "%s" и "%s" имеют одинаковые идентификаторы "%s"
en: "%s" and "%s" items have the same "%s" identifiers

source: Элементы "%s" и "%s" имеют одинаковые идентификаторы "%d"
en: "%s" and "%s" items have the same identifiers "%d"

source: Элементы "%s" и "%s" имеют одинаковые имена "%s"
en: "%s" and "%s" items have the same "%s" names

source: Невозможно пересоздать индекс имен элементов
en: Failed to re-create node name index

source: Поставщик информации "%s" уже зарегистрирован
en: "%s" vendor has already been registered

source: Конвертер имен из "%s" в "%s" поставщиков информации уже зарегистрирован
en: Name converter from "%s" to"%s" vendors already registered

source: фабрика объектов
en: factory of objects

source: Ошибка инициализации контекста добавляемого объекта %p
en: Error initializing the context of the added object %p

source: В списке для идентификатора %s %s уже существует
en: %s already exists in %s identifier list

source: В списке для идентификатора %s %s не существует
en: %s does not exist in %s identifier list

source: объект
en: object

source: Некорректный формат буфера обмена. Поддерживается только text/plain
en: Invalid clipboard format. Only text/plain is supported

source: Чтение значений запрещено
en: It is forbidden to read values

source: Поддерживаются только переводы строки CR+LF и LF
en: Only CR+LF and LF line breaks are supported

source: Запись значений запрещена
en: It is forbidden to write values

source: Столбец
en: Column

source: Столбец с назначением "%s" не найден
en: Column with usage type "%s" not found

source: Столбец "%s" типа "%s" не может быть непрерывным
en: "%s" column of "%s" type cannot be continuous

source: Функция %s может принимать только нечетное число аргументов
en: %s function can accept only odd number of arguments

source: Размер данных должен быть больше или равен нулю
en: Data size must be more than or equal to zero

source: Тип столбца %s не совместим с типом исходного столбца %s
en: %s column type is not compatible with %s source column type

source: Назначение "%s" недопустимо для настраиваемого столбца "%s"
en: Usage type "%s" is not valid for the configurable column "%s"

source: Столбец с именем %s не найден
en: Column with %s name not found

source: Ссылка на столбец не задана
en: No column link set

source: Тип столбца %s не совместим с типом исходного столбца
en: %s column type is not compatible with the source column type

source: Поле "%s" не принадлежит ни одному из используемых списков полей
en: "%s" field does not belong to any of the used field lists

source: Нельзя удалить не динамическую связь
en: Failed to delete non-dynamic link

source: Нельзя связывать столбцы "%s" и "%s", принадлежащие одной таблице
en: Failed to link "%s" and "%s" columns from the same table

source: Столбец "%s" таблицы %d может входить только в "одну" связь
en: "%s" column of table %d can only be part of a "single" link

source: Типы соединяемых столбцов "%s" и "%s" не совместимы
en: Type mismatch between linked columns "%s" and "%s"

source: При создании связи должно присутствовать поле из главной таблицы
en: A main table field must be provided to create the link

source: Достигнуто максимальное количество множественных связей
en: Maximum multiple links count reached

source: Соединение уже установлено
en: Already coupled

source: Расчет статистики
en: Calculating statistics

source: Не проинициализированы описания полей
en: Column definitions not initialized

source: Набор данных не находится в закрытом состоянии
en: Dataset is not in the closed state

source: Набор данных не находится в открытом состоянии
en: Dataset is not in the opened state

source: Набор данных не настроен
en: Dataset not configured

source: Набор данных не находится в состоянии редактирования
en: Dataset is not in the editable state

source: Нельзя вызвать метод EndUpdate предварительно не вызвав BeginUpdate
en: Failed to call EndUpdate method without calling BeginUpdate first

source: Нет ссылки на набор данных
en: No dataset reference

source: Описание узла "%s" не принадлежит текущему дереву
en: Description of "%s" node does not belong to the current tree

source: Невозможно добавить узел "%s" раньше родительского узла
en: Failed to append "%s" node before the parent node

source: Недопустим вызов метода Post для узла "%s" раньше вызова Post для дочерних узлов
en: Post method calling for "%s" node before the Post call for the child nodes is forbidden

source: Недопустим вызов метода Post для узла "%s" без вызова Append
en: Post method calling for "%s" node without the Append call is forbidden

source: Недопустим повторный вызов Append для узла "%s" без вызова Post
en: Repeated Append calling for "%s" node without the Post call is forbidden

source: Недопустим вызов метода Append для узла "%s", который не является контейнером или массивом
en: Calling the Append method for node "%s", which is not a container or array, is forbidden

source: Дерево данных не находится в закрытом состоянии
en: Data tree is not in the closed state

source: Дерево данных не находится в открытом состоянии
en: Data tree is not in the opened state

source: Дерево данных не настроено
en: Data tree not configured

source: Дерево данных не находится в состоянии редактирования
en: Data tree is not in the editable state

source: Узел "%s" не является предком узла "%s"
en: "%s" node is not ancestor of "%s" node

source: Невозможно получить признак существования контейнера для узла с идентификатором %d: узел не является контейнером
en: Failed to receive container indicator for node with identifier %d: the node is not a container

source: Ошибка при чтении файла "%s"
en: Error reading file "%s"

source: Узел %s в одном из полей JSON объявлен как массив, а в другом нет
en: Node %s is declared an array in one JSON field but not in another one

source: Узел %s в одном из полей JSON объявлен как контейнер, а в другом нет
en: Node %s is declared a container in one JSON field but not in another one

source: Превышение допустимого размера JSON
en: Allowable JSON size exceeded

source: Корень JSON не является объектом или массивом объектов
en: JSON root is not an object or an array of objects

source: Невозможно проинициализировать узел из исходного, который отличается значением признака контейнера
en: Failed to initialize the node from the source node which differs by the container flag value

source: Невозможно изменить вид данных узла, который является контейнером
en: Failed to change the data kind of the node that is a container
